CREATE TABLE themes (
id serial NOT NULL PRIMARY KEY,
name varchar (100) NOT NULL UNIQUE,
CHECK (name <> '')
)

INSERT INTO themes (name)
VALUES
('Детектив'),('Мистика'),('Фантастика'),('История'),('Программирование'),('Дизайн'),
('Администрирование'),('Приключения'),('Сказки')


CREATE TABLE countries (
id serial NOT NULL
PRIMARY KEY,
name varchar (50) NOT NULL UNIQUE,
CHECK (name <> '')
)

INSERT INTO countries (name)
VALUES
('Россия'),('Польша'),('Финляндия'),('Германия'),('Грузия'),('Армения'),
('Казахстан'),('Япония'),('Китай'),('Италия'),('Болгария')


CREATE TABLE shops (
id serial NOT NULL PRIMARY KEY,
name text NOT NULL,
CHECK (name <> ''),
country_id int NOT NULL,
FOREIGN KEY (country_id) REFERENCES countries(id)
)

INSERT INTO shops (name,country_id)
VALUES
('Буквоед',1),('Азбука',1),('Book`s Land',2),('Лабиринт',1),('Livralea Lello',3),('Grand Book',4),('Cook and Book',5),
('Book Store',6),('House of Book`s',7),('Libaria',8),('Barter Books',9),
('Atlantis Books',10),('Ateneo Books',11),('Last Book',2),('First Books',3),('Freedom Book',4),
('Polish Book`s',2),('Russian Book Shop',1),('Book`s for you',5),
('Mistery book`s',6),('Friendly Book`s',7),('Our book`s for you',8)


CREATE TABLE authors (
id serial NOT NULL
PRIMARY KEY,
name text NOT NULL,
CHECK (name<>''),
surname text NOT NULL,
CHECK (name<>''),
country_id int NOT NULL,
FOREIGN KEY (country_id) REFERENCES countries(id)
)

INSERT INTO authors (name,surname,country_id)
VALUES
('Alexander','Pushkin',1),('Michael','Lermontov',1),('Taras','Shevchenko',2),('Astred','Lindgren',3),('Lev','Tolstoy',1),
('Alexander','Grin',1),('Gerbert','Shildt',3),('Valter','Skott',4),('Alan','Po',5),('Jordge','Alliot',6),
('Nikolay','Leskov',1),('Mark','Tven',7),('Luis','Carroll',8),('Tomas','Mann',9),('Jack','London',10),
('Jordge','Oruell',11),('Philip','Pott',2),('Oskar','Wild',3),('William','Folkner',4),('Franc','Kafka',5),
('Bernard','Show',6),('Conan','Doyl',7),('Alex','Figurnov',1),('Tomas','Mann',8),('Anton','Chehov',1),
('Onore','DeBalsak',9),('Gustav','Flober',10),('Ernest','Heminguai',11),('Erih','Remark',2),('Jane','Ostin',3)


CREATE TABLE books (
id serial NOT NULL PRIMARY KEY,
name text NOT NULL,
CHECK (name <> ''),
pages int NOT NULL,
CHECK (pages > 0),
price money NOT NULL ,
CHECK (price > '0'),
publish_date date NOT NULL ,
CHECK (publish_date < CURRENT_DATE),
author_id int NOT NULL,
theme_id int NOT NULL,
FOREIGN KEY (author_id) REFERENCES authors (id),
FOREIGN KEY (theme_id) REFERENCES themes (id)
)

INSERT INTO books (name,pages,price,publish_date,author_id,theme_id)
VALUES
('Сказка о рыбаке и рыбке',100,'110,5','10-10-2021',1,1),('Понедельник начинается',105,'22,5','10-10-2020',10,6),
('Дизайн',200,'222,5','10-10-2020',2,2),('Мы',205,'33,5','10-10-2021',11,7),
('Java',300,'11,5','10-10-2019',3,3),('Прощай оружие',305,'445,4','10-10-2019',12,8),
('История',400,'15,5','10-10-2018',4,4),('Доктор Живаго',405,'44,5','10-10-2018',13,9),
('Phyton',500,'116,0','10-10-2017',5,5),('Камера обскура',605,'55,5','10-10-2017',14,1),
('История государства российского',600,'22,0','10-10-2016',6,6),('Фауст',705,'66,5','10-10-2016',15,2),
('Алые паруса',700,'33,5','10-10-2015',7,7),('Божественная комедия',134,'77,5','10-10-2017',16,3),
('Энциклопедия',800,'55,0','10-10-2014',8,8),('Заводной апельсин',234,'88,5','10-10-2018',17,4),
('Шерлок Холмс',900,'22,1','10-10-2013',9,9),('Чапаев',334,'99,5','10-10-2021',18,5),
('Microsoft Server',800,'33,5','10-10-2012',10,1),('Повелитель мух',432,'100,5','10-10-2000',19,6),
('Тайны Microsoft',700,'10,4','10-10-2011',1,2),('Чума',555,'12,99','10-10-2001',20,7),
('Microsoft Windows',600,'222,7','10-10-2010',12,3),('Сегун',654,'1,1','10-10-2002',21,8),
('Дартаньян и 3 мушкетера',500,'110,9','10-10-2009',13,4),('Марсианские хроники',765,'22,3','10-10-2003',22,9),
('Кардинал и 1 король',400,'232,6','10-10-2008',14,5),('Солярис',125,'113,1','10-10-2004',23,1),
('История Грузии',300,'55,0','10-10-2007',15,6),('Honda Accord ремонт',233,'22,5','10-10-2005',24,2),
('Журнал Специалист',200,'33,5','10-10-2006',16,7),('Phyton для чайников',432,'33,5','10-10-2006',25,3),
('Генерал Же Голль',100,'22,5','10-10-2005',17,8),('Java для чайников',332,'44,5','10-10-2007',26,4),
('Обучение Java',150,'10,1','10-10-2004',18,9),('Чайник для чайников',101,'1555,5','10-10-2008',27,5),
('33 богатыря',250,'111,5','10-10-2003',19,1),('C++ для чайников',102,'66,5','10-10-2009',28,6),
('Jack the Ripper',350,'555,5','10-10-2002',20,2),('Степной волк',103,'77,5','10-10-2010',29,7),
('Мастер и Маргарита',450,'113,5','10-10-2001',21,3),('Легкость бытия',104,'777,5','10-10-2011',30,8),
('Собачье сердце',550,'115,99','10-10-2000',22,4),('Пена дней',105,'88,5','10-10-2012',1,9),
('Маленький принц',650,'22,5','10-10-2001',23,5),('Осиная фабрика',106,'166,5','10-10-2013',2,1),
('Три товарища',750,'15,5','10-10-2002',24,6),('Мир глазами Гарпа',652,'999,5','10-10-2014',1,2),
('Над пропастью во ржи',850,'14,5','10-10-2003',25,7),('Английский пациент',122,'1100,5','10-10-2015',2,3),
('Герой нашего времени',950,'14,5','10-10-2004',26,8),('Унесенные ветром',552,'56,4','10-10-2016',3,4),
('Приключения Шерлока Холмса',120,'155,5','10-10-2005',27,9),('451 градус',205,'100,5','10-10-2017',4,5),
('Властелин колец',220,'15,0','10-10-2006',28,1),('1984',206,'1111,5','10-10-2018',5,6),
('Пластилиновый гонец',320,'19,5','10-10-2007',29,2),('Парфюмер',207,'2222,5','10-10-2019',6,7),
('Крестный отец',420,'99,5','10-10-2008',30,3),('Белый клык',208,'133,5','10-10-2020',7,8),
('Триумфальная арка',520,'88,5','10-10-2009',5,4),('Гордость и предубеждение',209,'1332,5','10-10-2010',8,9),
('Мертвые души',620,'77,5','10-10-2010',6,5),('12 стульев',210,'44,4','10-10-2011',9,1),
('Поющие в терновнике',720,'66,5','10-10-2011',1,6),('Идиот',240,'333,5','10-10-2012',10,2),
('Грозовой перевал',830,'55,5','10-10-2012',2,7),('Джейн Эйр',242,'555,9','10-10-2013',11,3),
('На западном фронте без перемен',730,'44,5','10-10-2013',3,8),('Старик и море',333,'1556,5','10-10-2014',12,4),
('Демиан',630,'33,5','10-10-2014',4,9),('Великий Гэтсби',301,'765,5','10-10-2015',13,5),
('Зеленая миля',530,'22,5','10-10-2015',5,1),('Убить пересмешника',901,'987,5','10-10-2016',14,6),
('Робинзон Крузо',430,'111,5','10-10-2016',6,2),('Отверженные',101,'17,5','10-10-2017',15,7),
('Алиса в стране чудес',330,'112,5','10-10-2017',7,3),('Собор Парижской богоматери',224,'14,5','10-10-2018',16,8),
('По ком звонит колокол',230,'113,5','10-10-2018',8,4),('Овод',653,'13,5','10-10-2019',17,9),
('Мартин Иден',165,'114,5','10-10-2019',9,5),('Коллекционер',198,'133,5','10-10-2020',18,1)


CREATE TABLE sales (
id serial NOT NULL PRIMARY KEY,
price money NOT NULL,
CHECK (price >= '0'),
quantity int NOT NULL,
CHECK (quantity >= 0),
sale_date date NOT NULL DEFAULT CURRENT_DATE  ,
CHECK (sale_date <= CURRENT_DATE),
book_id int NOT NULL,
shop_id int NOT NULL,
FOREIGN KEY (book_id) REFERENCES  books (id),
FOREIGN KEY (shop_id) REFERENCES shops (id)
)


INSERT INTO sales (price,quantity,sale_date,book_id,shop_id)
VALUES
('100',10,'01-02-2021',824,1),('150',11,'16-01-2021',837,14),('220',22,'01-01-2022',850,1),
('200',9,'01-03-2021',825,2),('250',12,'17-01-2021',838,15),('320',12,'02-01-2022',851,2),
('300',8,'01-04-2021',826,3),('350',13,'18-01-2021',839,16),('420',12,'03-01-2022',852,3),
('400',7,'01-05-2021',827,4),('450',14,'19-01-2021',840,17),('520',1,'04-01-2022',853,4),
('500',6,'01-06-2021',828,5),('650',15,'20-01-2021',841,18),('620',2,'05-01-2022',854,1),
('600',5,'01-07-2021',829,6),('750',16,'21-01-2021',842,19),('720',3,'06-01-2022',855,2),
('700',4,'01-08-2021',830,7),('850',17,'22-01-2021',843,20),('820',44,'07-01-2022',856,3),
('800',3,'01-09-2021',831,8),('950',18,'23-01-2021',844,21),('920',12,'08-01-2022',857,4),
('900',2,'01-10-2021',832,9),('1050',19,'25-01-2021',845,22),('1020',122,'09-01-2022',858,5),
('1000',1,'01-11-2021',833,10),('1150',20,'02-02-2021',846,2),('1120',16,'10-01-2022',859,6),
('2000',10,'01-12-2021',834,11),('1250',21,'01-02-2021',847,1),('1220',77,'11-01-2022',860,7),
('3000',9,'01-01-2021',835,12),('1350',22,'01-02-2021',848,2),('1320',6,'12-01-2022',862,8),
('4000',8,'02-01-2021',836,13),('1450',23,'01-02-2021',849,3),('1420',8,'13-01-2022',863,9),
('100',10,'03-01-2021',864,1),('150',11,'01-02-2021',877,4),('220',22,'14-01-2022',890,2),
('200',9,'04-01-2021',865,2),('250',12,'11-03-2021',878,5),('320',12,'15-01-2022',891,1),
('300',8,'05-01-2021',866,3),('350',13,'11-04-2021',879,6),('420',12,'16-01-2022',892,1),
('400',7,'06-01-2021',867,4),('450',14,'12-05-2021',880,7),('520',1,'17-01-2022',893,2),
('500',6,'07-01-2021',868,5),('650',15,'12-05-2021',881,8),('620',2,'18-01-2022',894,1),
('600',5,'08-01-2021',869,6),('750',16,'13-06-2021',882,9),('720',3,'19-01-2022',895,2),
('700',4,'09-01-2021',870,7),('850',17,'14-06-2021',883,10),('820',44,'20-01-2022',896,3),
('800',3,'10-01-2021',871,8),('950',18,'01-06-2021',884,11),('920',12,'21-01-2022',897,4),
('900',2,'11-01-2021',872,9),('1050',19,'02-07-2021',885,12),('1020',122,'22-01-2022',898,5),
('1000',1,'12-01-2021',873,10),('1150',20,'03-06-2021',886,13),('1120',16,'23-01-2022',899,6),
('2000',10,'13-01-2021',874,11),('1250',21,'04-06-2021',887,14),('1220',77,'24-01-2022',890,7),
('3000',9,'14-01-2021',875,12),('1350',22,'05-06-2021',888,15),('1320',6,'25-01-2022',892,8),
('4000',8,'15-01-2021',876,13),('1450',23,'06-06-2021',889,16),('1420',8,'26-01-2022',893,9)


--1. Показать все книги, количество страниц в которых больше
500, но меньше 650.

SELECT
    name AS Название_книги,
    pages AS Количество_страниц
FROM books
WHERE
    pages BETWEEN 501 AND 649

--2. Показать все книги, в которых первая буква названия либо
--«А», либо «З».

SELECT
     name
FROM books b
WHERE b.name LIKE 'З%' OR b.name LIKE 'А%'
ORDER BY b.name

--3. Показать все книги жанра «Детектив», количество проданных
--книг более 30 экземпляров.

SELECT
    b.name AS Название_книги,
    SUM (quantity) AS Количество_проданных_книг
FROM sales s
JOIN books b ON b.id=s.book_id

WHERE quantity>30
GROUP BY b.name
ORDER BY b.name

--4. Показать все книги, в названии которых есть слово «Microsoft
--», но нет слова «Windows».
SELECT
     name AS Название_______книги
FROM books
WHERE name LIKE '%Microsoft%' AND name NOT LIKE '%Windows%'
ORDER BY name

--5. Показать все книги (название, тематика, полное имя автора
--в одной ячейке), цена одной страницы которых меньше
--65 копеек.
SET lc_monetary TO "en_US.UTF-8";
SELECT
    b.name AS Название___книги,
    (b.price /b.pages) AS Цена_страницы,
    t.name AS Тематика ,
    a.name || ' ' || a.surname AS Имя_и_фамилия_автора
FROM books b
JOIN themes t ON t.id=b.theme_id
JOIN authors a ON a.id=b.author_id
WHERE ROUND (b.price::numeric/b.pages)<0.65
ORDER BY Цена_страницы


--6. Показать все книги, название которых состоит из 4 слов.

SELECT
    b.name AS Название________________книги,
    (LENGTH(b.name)-LENGTH(REPLACE (b.name,' ','')))+1 AS Количество_слов_в_названии
FROM books b
WHERE (LENGTH(b.name)-LENGTH(REPLACE (b.name,' ','')))+1=4

--7. Показать информацию о продажах в следующем виде:
--▷▷Название книги, но, чтобы оно не содержало букву «А».
--▷▷Тематика, но, чтобы не «Программирование».
--▷▷Автор, но, чтобы не «Герберт Шилдт».
--▷▷Цена, но, чтобы в диапазоне от 10 до 20 гривен.
--▷▷Количество продаж, но не менее 8 книг.
--▷▷Название магазина, который продал книгу, но он не
--должен быть в Украине или России.

SELECT b.name,t.name,a.name || a.surname,b.price,s.quantity,sh.name
FROM books b
JOIN themes t ON b.theme_id=t.id
JOIN authors a ON b.author_id=a.id
JOIN sales s ON b.id=s.book_id
JOIN shops sh ON s.shop_id=sh.id
JOIN countries c ON sh.country_id=c.id
WHERE b.name NOT LIKE '%А%'
AND t.name <> 'Программирование'
AND (a.name <> 'Герберт' AND a.surname !='Шилдт')
AND (b.price <'20' AND b.price > '10')
AND s.quantity >=8
AND (c.name != 'Россия' AND c.name != 'Украина')

--8. Показать следующую информацию в два столбца (числа
--в правом столбце приведены в качестве примера):
--▷▷Количество авторов: 14
--▷▷Количество книг: 47
--▷▷Средняя цена продажи: 85.43 грн.
--▷▷Среднее количество страниц: 650.6.

SELECT
	'Авторы' as type,
	COUNT (*) as cnt
FROM authors a

union

SELECT
	'Книги' as type,
	COUNT (*) as cnt
FROM books b

union

SELECT
	'Средняя_цена_продажи' as type,
	ROUND (AVG (price::numeric),2) as cnt
FROM sales

union

SELECT
	'Среднее_количество_страниц' as type,
	ROUND (AVG(pages),0) as cnt
FROM books

--9. Показать тематики книг и сумму страниц всех книг по
--каждой из них.

SELECT
    t.name AS Тематика,
    SUM (pages) AS Сумма_страниц
FROM themes t
JOIN books b ON t.id=b.theme_id
GROUP BY t.name

--10. Показать количество всех книг и сумму страниц этих книг
--по каждому из авторов.

SELECT
	a.id,
	a.name || ' ' || a.surname AS fullname,
	COUNT (b) AS Количество_книг,
	SUM (b.pages) AS Сумма_страниц
FROM authors a
JOIN books b ON a.id=b.author_id
GROUP BY a.id
ORDER BY fullname

--11. Показать книгу тематики «Программирование» с наибольшим
--количеством страниц.

SELECT b.name,b.pages
FROM books b
WHERE
b.theme_id = (SELECT id FROM themes WHERE name = 'Программирование')
ORDER BY pages DESC LIMIT 1

-- или так

SELECT b.name,b.pages
FROM books b
WHERE
b.theme_id = (SELECT id FROM themes WHERE name = 'Программирование')
AND b.pages = (SELECT MAX(pages) FROM books WHERE theme_id = b.theme_id)

--12. Показать среднее количество страниц по каждой тематике,
--которое не превышает 400.

SELECT t.name AS Название_тематики,ROUND (AVG (pages),0) AS Среднее_количество_страниц
FROM themes t
JOIN books b ON t.id=b.theme_id
WHERE (SELECT ROUND (AVG (pages),0) FROM books WHERE id = b.id) <=400
GROUP BY t.name

--13. Показать сумму страниц по каждой тематике, учитывая
--только книги с количеством страниц более 400, и чтобы
--тематики были «Программирование», «Администрирование
--» и «Дизайн».

SELECT t.name AS Тематика,ROUND (AVG (b.pages),0) AS Среднее_количество_страниц
FROM themes t
JOIN books b ON t.id=b.theme_id
WHERE t.name IN ('Программирование','Администрирование','Дизайн')
AND (SELECT AVG(pages) FROM books WHERE id = b.id)>400
GROUP BY t.name


--14. Показать информацию о работе магазинов: что, где, кем,
--когда и в каком количестве было продано.

SELECT b.name AS Название_проданных_книг,c.name AS Страна,sh.name AS Магазин,
s.sale_date AS Дата_продажи,s.quantity AS Количество_проданных_книг
FROM sales s
JOIN books b ON s.book_id=b.id
JOIN shops sh ON s.shop_id=sh.id
JOIN countries c ON sh.country_id=c.id
ORDER BY s.sale_date


--15. Показать самый прибыльный магазин.
SELECT s.shop_id , SUM (s.price*s.quantity)
FROM sales s
GROUP BY s.shop_id









